def bmi_calc(m, h):
    result = m/(h**2)
    return result


if __name__ == '__main__':
    print('\n\n'+'================= Калькулятор BMI =================')
    print('\n')
    m = float(input('Введите массу тела в килограммах: '))
    h = float(input('Введите ваш рост в метрах: '))
    i = round(bmi_calc(m, h), 2)
    print('Ваш индекс массы тела: ', i, 'кг/м2')
    start = 0
    end = 50
    print('\n')
    print(str(start)+'='*(int(round(i, 0))-start-1)+'||'+'='*(end-int(round(i, 0))-1)+str(end))
    if i < 18.5:
        print('Интерпретация показателя: Недостаточная масса тела')
    elif i > 25:
        print('Интерпретация показателя: Избыточная масса тела')  
    else:
        print('Интерпретация показателя: Нормальное значение массы тела')
    print('\n')
    input('=============== Программа завершена ===============')    
